```cobol
       IDENTIFICATION DIVISION.                                     
       PROGRAM-ID. HELLO.    
       * This program is a simple demonstration of COBOL's capabilities.                                         
      **
       ENVIRONMENT DIVISION.
      * This division specifies the configuration of the system environment.
      ** 
       DATA DIVISION.
      * Here is where the program's variables would be declared. Currently, this program does not use any variables.
      **
       PROCEDURE DIVISION.  
       * The following is the core logic of the program.                                         
           DISPLAY 'HELLO WORLD'. 
           * This line outputs the text "HELLO WORLD" to the user.                                   
           STOP RUN.  
           * This statement terminates the program.                                             
```